# Changing a data format in a dataset

## importing pandas

In [1]:
import pandas as pd

## Loading dataset and including relevant columns

In [2]:
marketing_data = pd.read_csv('Data/marketing_campaign.csv')
marketing_data = marketing_data[['ID', 'Year_Birth','Marital_Status','Income']]

In [3]:
marketing_data.head(10)

     ID  Year_Birth Marital_Status   Income
0  5524        1957         Single  58138.0
1  2174        1954         Single  46344.0
2  4141        1965       Together  71613.0
3  6182        1984       Together  26646.0
4  5324        1981        Married  58293.0
5  7446        1967       Together  62513.0
6   965        1971       Divorced  55635.0
7  6177        1985        Married  33454.0
8  4855        1974       Together  30351.0
9  5899        1950       Together   5648.0

In [4]:
marketing_data.shape

(2240, 4)

## Fill NAs in the Income column:

In [5]:
marketing_data['Income'] = marketing_data['Income'].fillna(0)

## Change the data type of the Income column from float to int:

In [7]:
marketing_data['Income_changed'] = marketing_data['Income'].astype(int)

In [8]:
marketing_data[['Income', 'Income_changed']].head(10)

    Income  Income_changed
0  58138.0           58138
1  46344.0           46344
2  71613.0           71613
3  26646.0           26646
4  58293.0           58293
5  62513.0           62513
6  55635.0           55635
7  33454.0           33454
8  30351.0           30351
9   5648.0            5648

In [9]:
marketing_data[['Income', 'Income_changed']].dtypes

Income            float64
Income_changed      int32
dtype: object